<template lang="jade">
    mu-row(gutter)
        mu-col(desktop="50",v-for="item in classify",style='padding: 0 20px;',:key="item.id")  
            h2 {{item.title}}
            mu-menu(desktop="100")
                mu-menu-item(desktop="50",v-for="list in item.list",:title="list",to='/sdk/list',:key="list.id")
</template>

<script>
export default {
    name: 'sdk',
    data() {
        return {
            classify: [
                {
                    title: "应用和数据",
                    list: ["应用和数据", "云存储", "CDN", "云计算", "云引擎", "云测试", "云媒体", "云主机", "PaaS", "大数据工具", "实时后端服务/API", "其它云", "开发框架（全栈）", "微框架（后端）", "跨平台移动开发", "移动框架", "开发框架（其它）", "数据库", "数据库工具", "非关系型数据库（NoSQL）即服务", "任务处理", "移动数据库", "移动后端", "Node.js 主机", "图表库", "Javascript库和工具", "游戏引擎", "多媒体资源和CDN", "图像处理及管理", "文件存储", "CDN公共库加速服务", "数据银行", "专业数据", "容器云", "SaaS部署", "金融云", "物联网（IoT）服务", "车联网 IoV"]
                },
                {
                    title: "DevOps",
                    list: ["开源云", "代码审查", "持续集成", "服务器管理", "云管理", "安全管理", "组合Web服务框架", "影响力检测", "监测工具", "云监控", "日志管理", "性能监控 APM", "聚合监控平台", "移动应用错误监控", "速度与稳定性测试", "Docker相关工具", "Docker即服务", "Docker工具", "GitHub工具", "源码协作及版本控制", "应用测试/分发", "性能测试"]
                },
                {
                    title: "实用工具",
                    list: ["地图", "SSL证书", "推送", "语音", "社交评论", "第三方登录", "二维码", "即时通讯", "应用安全及加密", "移动短信", "支付平台", "服务类API", "API集成和管理", "电子商务", "网站加速器", "用户反馈即服务", "翻译", "实时数据处理", "联系人管理", "网页抓取工具", "快递服务", "数据安全服务", "身份验证即服务", "自然语言处理（NLP）/情感分析", "计算机视觉及人脸识别", "Web应用构建工具", "电子表格后端服务", "社交分享", "游戏开放平台", "快速开发", "工具类", "多媒体处理", "增强现实(AR)技术", "输入法", "其它开发", "开发组件", "登陆验证", "WebFont字体库", "奇葩工具", "云梯", "其它工具", "机器学习", "集成平台", "H5 开发", "深度链接即服务", "移动应用商店优化", "移动游戏应用管理", "移动应用营销工具", "通讯开发组件", "语音和短信", "音频播放", "邮件服务", "综合分析", "移动A/B测试", "统计服务", "可视化数据分析及展示", "联机分析处理（OLAP）", "开发学习", "技术咨询和服务", "API相关工具", "视觉设计", "交互设计", "原型设计", "富文本编辑器", "搜索引擎", "域名注册", "DNS管理", "无人机", "智能设备", "Mac神器"]
                },
                {
                    title: "商业工具",
                    list: ["社交媒体工具", "CRM", "邮件营销", "邮件测试", "市场营销工具", "调查问卷工具", "用户画像", "通讯即服务", "广告平台", "广告聚合", "应用市场", "营销策略", "其它推广", "APP推广", "运营工具", "论坛和社区", "团队沟通协作工具", "录屏直播", "项目管理", "聊天机器人", "协作文档", "企业协作", "网络视频会议", "即时聊天", "效率工具", "设计协作工具", "本地化翻译协作平台", "公司注册及法律服务", "在线客服系统", "移动应用客服", "众包", "众包测试", "众筹", "安全漏洞反馈奖励平台"]
                }
            ]
        }
    },
    mounted: function () {

    },
    methods: {

    }
}
</script>

<style scoped>

</style>