<template lang="jade">
    mu-paper.content
        h3 课程安排
        p 在一个知识更新如此快的世界里，今天的技术与昨天或明天的技术都可能会不一样，那个你应该学什么专业？
        p 在P8 CodeA学习到的编程内容是面向企业的，遵循逻辑顺序的，通用的17个技能，而不是一系列的语言和特定的技术。
        p 这些技能也很重要：个人的适应性，学习能力，应对和解决新挑战的能力。
        h3 以2年为基准
        p 每个学生按照自己的节奏进行学习，没有固定的时间限制，我们也不会对学生进行排名。在P8 Codea，学习都是100%个性化的，没有人会落后。
        p P8 Codea 的课程被设计成大致在2年内完成（包括实习时间）。但根据每个学生的特殊需要，这个时间也许会减少或增加。2年的时间是适合每个学生能够学习到专业的技术与创新，并获得早期工作经验 。
        h3 知识加速器
        p 如果你比其他人更快的完成项目，即使没有在CodeA第一学期入学，也可以直接研究二年级的内容，一些高年级学生也可以帮助你前进，甚至，比高年级的同学更早的完成研究。
        h3 生活放慢器
        p 你确实可以更快的完成项目，但我们更加希望看到精品，艺术品。
        p 如果你必须离开学校一段较长的时间，当你返回到Codea时，你的项目还在那里，并没有取消。
        h3 如何合作学习？
        p Peer-to-peer
        p 不要课程，不要老师
        p 你自己负责的学业和同学的学业，在实践的课程项目中推进技能，你必须依靠群体的力量，给予和接受你所获得的知识，自己学习的同时也给同学分享。这种教学模式去除了师生的从属关系。
        p 协同工作是P8 CodeA的基础。集体探讨是常态，这有助于处理个人和集体的关系，以及更好的完成项目。
        p 你如何面对别人的怀疑？什么是最好的方式去回答问题？如何实现最优解决方案？
        p 通过解决这些问题，你将不断自我提高沟通与协作能力。在你自己的项目组中，努力向前，并且提升自己的能力，注意，不是简单的复制或参考老师的教程，而是寻找，实验和捍卫你自己的想法。在CodeA，你不再是被动的等着知识，而是必须自发的驱动自己，寻找解决方案。
        h3 合作评价
        p 每当一个项目结束，学习并不会停止。每个项目组的成员需要得到用户的评价---你的同学们。每个项目都是由多个同学评估。 一个项目，评估方法是基于主题和项目规模的，首先发现的是Bugs和多余的功能。你还必须学会捍卫自己的观点及及时解决问题 。
        h3 合作教学
        p 我们拥有一个多元化的P8社区，有企业，有生活社区。加上学生们互相学习取代了传统的以老师为主的教育系统。因此，学生们不再是为了老师为了学业而完成项目，而是真正的与企业的商业项目一决高下。

</template>

<script>
export default {
    name: 'school-contact',
    data() {
        return {

        }
    },
    mounted: function () {
        document.body.scrollTop = 0;
        document.documentElement.scrollTop = 0;
    },
    methods: {

    }
}
</script>

<style scoped>
.content{padding:20px;}
</style>